package JavaRush.Level8;

import java.io.IOException;
import java.util.*;

public class Block_27 {

    /*
Минимальное из N чисел

1. Ввести с клавиатуры число N.
2. Считать N целых чисел и заполнить ими список - метод getIntegerList.
3. Найти минимальное число среди элементов списка - метод getMinimum.

Требования:
•	Программа должна выводить текст на экран.
•	Программа должна считывать значения с клавиатуры.
•	Класс Solution должен содержать только три метода.
•	Метод getIntegerList() должен считать с клавиатуры число N, потом вернуть список размером
 N элементов, заполненный числами с клавиатуры.
•	Метод getMinimum() должен вернуть минимальное число среди элементов списка.
•	Метод main() должен вызывать метод getIntegerList().
•	Метод main() должен вызывать метод getMinimum().
*/


    public static void main(String[] args) throws Exception {
        List<Integer> integerList = getIntegerList();
        System.out.println(getMinimum(integerList));
    }

    public static int getMinimum(List<Integer> array) {
        // Найти минимум тут
        int min = array.get(0);
        for (int i = 0; i < array.size(); i++) {
            if (array.get(i) < min) {
                min = array.get(i);
            }
        }
        return min;
    }

    public static List<Integer> getIntegerList() throws IOException {
        // Создать и заполнить список тут
        Scanner scanner = new Scanner(System.in);
        int num = scanner.nextInt();
        List<Integer> list = new ArrayList<>();
        for (int i = 0; i < num; i++) {
            list.add(scanner.nextInt());
        }
        return list;
    }
}